In [1]:
import pandas as pd
import glob

# Specify the path to the directory containing the CSV files
csv_directory = r'C:\Users\rhema\OneDrive\Desktop\Dataset'

# Use glob to retrieve a list of all CSV file paths in the directory
csv_files = glob.glob(csv_directory + '\\*.csv')

# Initialize an empty list to store the individual data frames
dfs = []

# Loop through each CSV file and append its contents to the list
for file in csv_files:
    df = pd.read_csv(file)
    dfs.append(df)

# Concatenate all data frames in the list into a single data frame
combined_df = pd.concat(dfs)

# Write the combined data frame to a new CSV file
combined_df.to_csv('combined_file.csv', index=False)

C:\Users\rhema\AppData\Local\Temp\ipykernel_32984\2472146183.py:15: DtypeWarning: Columns (9) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(file)

In [2]:
df = pd.read_csv('combined_file.csv')

C:\Users\rhema\AppData\Local\Temp\ipykernel_32984\3496158464.py:1: DtypeWarning: Columns (9) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('combined_file.csv')

In [3]:
df.head()

,YEAR,MO,DY,HR,WS50M,Location,Latitude,Longitude,Unnamed: 8,Unnamed: 9
0,2013,1,1,2,5.25,Kajiado,-1.8313,36.7987,NaN,NaN
1,2013,1,1,3,4.96,Kajiado,-1.8313,36.7987,NaN,NaN
2,2013,1,1,4,4.77,Kajiado,-1.8313,36.7987,NaN,NaN
3,2013,1,1,5,4.64,Kajiado,-1.8313,36.7987,NaN,NaN
4,2013,1,1,6,4.55,Kajiado,-1.8313,36.7987,NaN,NaN

In [4]:
df.Location.unique()

array(['Kajiado', 'Laikipia', 'Marsabit ', 'Meru ', 'Nyeri', 'Maralal'],
      dtype=object)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526032 entries, 0 to 526031
Data columns (total 10 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   YEAR        526032 non-null  int64
 1   MO          526032 non-null  int64
 2   DY          526032 non-null  int64
 3   HR          526032 non-null  int64
 4   WS50M       526032 non-null  float64
 5   Location    526032 non-null  object
 6   Latitude    526032 non-null  float64
 7   Longitude   526032 non-null  float64
 8   Unnamed: 8  0 non-null       float64
 9   Unnamed: 9  1 non-null       object
dtypes: float64(4), int64(4), object(2)
memory usage: 40.1+ MB